{
  "sections": [
    {
      "id": "visualizing_debugging",
      "subtitle": "Visualizing React Debugging with HiFiber",
      "paragraphs": [
        "HiFiber is a Chrome DevTool tailored for frontend engineers at any stage of their career. It simplifies the debugging of React applications by offering advanced visualization and analysis of the React Fiber tree. This tool is designed to improve codebase understanding and enhance performance optimization by identifying inefficiencies in the rendering process."
      ]
    },
    {
      "id": "navigating_complexity",
      "subtitle": "Navigating the Complexity of the React Fiber Tree",
      "paragraphs": [
        "Frontend engineers are often challenged with debugging the intricate React Fiber tree, as conventional tools lack clarity in identifying performance issues and redundant re-renders.",
        "HiFiber offers a solution with its advanced visualization engine, simplifying the mapping of the React Fiber tree after reconciliation. This aids developers in pinpointing critical nodes, examining render times and tracking state changes, thus improving the debugging process and application performance."
      ],
      "background": "bg-lightblue-grid-background",
      "photo": {
        "src": "/images/portfolio-pages/hifiber/demo-loop-monitor.gif",
        "alt": "demo-loop-monitor"
      }
    },
    {
      "id": "how_it_works",
      "subtitle": "How It Works",
      "paragraphs": [
        "HiFiber is built on a simple but robust tech stack that includes JavaScript for its versatility, React for dynamic user interfaces and AWS S3 for scalable storage solutions. This combination ensures a seamless integration with Chrome DevTools, offering an optimized experience for visualizing React's Fiber Tree.",
        "Leveraging D3.js for data visualization, our tool provides detailed insights into performance metrics and component structures, making it an invaluable resource for developers looking to optimize React applications efficiently."
      ],
      "background": "graph-paper-bg",
      "textColor": "black",
      "flowchart": "/images/diagrams/flowchart-hifiber.svg"
    },
    {
      "id": "technology_stack",
      "subtitle": "Technology Stack",
      "paragraphs": [
        "I chose this stack for its ability to ensure robust development, seamless user experience, efficient backend management, and automated workflows — facilitating quality, scalability and versatility."
      ],
      "technologyStack": [
        {
          "imgSrc": "/images/technology-icons/tech-javascript.png",
          "altText": "javascript-logo"
        },
        {
          "imgSrc": "/images/technology-icons/tech-react.png",
          "altText": "react-logo"
        },
        {
          "imgSrc": "/images/technology-icons/tech-chrome-devtools.png",
          "altText": "chrome-devtools-logo"
        },
        {
          "imgSrc": "/images/technology-icons/tech-d3.png",
          "altText": "d3-logo"
        },
        {
          "imgSrc": "/images/technology-icons/tech-s3.png",
          "altText": "aws-s3-logo"
        }
      ]
    },
    {
      "id": "expanding_horizons",
      "subtitle": "Expanding Horizons: From Visualization to Optimization",
      "paragraphs": [
        "Looking forward, HiFiber aims to broaden its impact through containerization for diverse development environments, integrating D3.js for more refined data visualization, and incorporating NoSQL databases for performance metric caching over time.",
        "These enhancements promise to make frontend debugging not just simpler, but also a more data-driven and insightful experience."
      ],
      "background": "bg-lightblue-grid-background",
      "photo": {
        "src": "/images/portfolio-pages/hifiber/engineer-at-computer.png",
        "alt": "classroom-raised-hands"
      }
    }
  ],
  "in-app-screenshots": [
    "/images/screenshots/hifiber/hifiber-screenshot-b.png",
    "/images/screenshots/hifiber/hifiber-screenshot-a.png"
  ]
}
